Repository: ararthur/BBQuery
Catalog: App_LocalResources/Settings.ascx.*.resx
Languages: de_de

# Configure.Message
source: Please configure module first!
de_de: Konfigurieren Sie zunächst dasModul!

# ControlTitle_settings.Text
source: BBQuery Module Settings
de_de: BBQuery Modul-Einstellungen

# lblAllowDeletes.Help
source: Check if you want to allow special users to delete data
de_de: Überprüfen Sie, ob Sie speziellen Benutzergruppem das Löschen erlauben möchten

# lblAllowDeletes.Text
source: Allow Deletes
de_de: Löschen zulassen

# lblAllowEdits.Help
source: Check if you want to allow special users to edit data
de_de: Überprüfen Sie, ob Sie ob Sie speziellen Benutzergruppen das Bearbeiten erlauben möchten

# lblAllowEdits.Text
source: Allow Edits
de_de: Bearbeitungen zulassen

# lblConnectionString.Help
source: Please enter the connection string for connection to your data source
de_de: Bitte geben Sie die Verbindungszeichenfolge (Connection String) für die Verbindung zu Ihrer Datenquelle ein.

# lblConnectionString.Text
source: Connection String
de_de: Verbindungszeichenfolge

# lblDelete.Help
source: Enter the DELETE SQL statement which should delete the data. Use parameter syntax (e.g. DELETE FROM Table WHERE idfield=@idfield)
de_de: Tragen Sie die DELETE SQL-Anweisung ein mit dem die Daten gelöscht werden sollen. Verwenden Sie Parametersyntax (z. B. DELETE FROM Tabelle WHERE idfield=@idfield)

# lblDelete.Text
source: Delete Command
de_de: DELETE-Befehl

# lblIntro.Text
source: Define SQL Commands, Parameters and so on....
de_de: Definieren Sie SQL-Befehle, Parameter und so weiter....

# lblKey.Help
source: Please enter the primary key of your selection
de_de: Bitte geben Sie den Primärschlüssel Ihrer Auswahltabelle ein

# lblKey.Text
source: Primary Key
de_de: Primärschlüssel

# lblProvider.Help
source: Please select the database provider for connection to your data source
de_de: Bitte wählen Sie den Datenbankanbieter (Provider) für die Verbindung zu Ihrer Datenquelle

# lblProvider.Text
source: Database Provider
de_de: Datenbankanbieter

# lblRoleAllowDeletes.Help
source: Select the role a user needs to have delete rights (if 'allow delete' is true)
de_de: Wählen Sie die Benutzerrolle, die ein Benutzer haben muss um löschen zu dürfen (wenn "Löschen erlauben" ausgewählt ist)

# lblRoleAllowDeletes.Text
source: Delete Role
de_de: Löschen-Benutzerrolle

# lblRoleAllowEdits.Help
source: Select the role a user needs to have edit rights (if 'allow edits' is true)
de_de: Wählen Sie die Benutzerrolle, die ein Benutzer haben muss um Bearbeitungsrechte zu haben (wenn 'Änderungen zulassen' ausgewählt ist)

# lblRoleAllowEdits.Text
source: Edit Role
de_de: Bearbeiten-Benutzerrolle

# lblSqlCommand.Help
source: Enter the SELECT SQL command which selects the data to be shown in result view
de_de: Geben Sie den SQL SELECT-Befehl ein der der die Daten für die Ergebnisanzeige auswählt

# lblSqlCommand.Text
source: Select Command:
de_de: SELECT - Befehl:

# lblUpdate.Help
source: Enter the UPDATE SQL statement which should update the data. Use parameter syntax (e.g. UPDATE Table SET field1=@field1, field2=@field2 WHERE idfield=@idfield)
de_de: Tragen Sie die UPDATE SQL-Anweisung ein mit dem die Daten aktualisiert werden sollen.Verwenden Sie Parametersyntax (zB. UPDATE Tabelle SET field1=@field1, field2=@field2 wo idfield=@idfield)

# lblUpdate.Text
source: Update Command
de_de: Update-Befehl

# Select.Text
source: Select Settings
de_de: Wählen Sie Einstellungen

# valConnectionString.Error
source: Connection String is manatory!
de_de: Verbindungszeichenfolge ist manatory!

# valKey.Error
source: Promary key is mandatory
de_de: Primary Schlüssel ist obligatorisch.

# valSqlCommand.Error
source: Select command is mandatory!
de_de: SELECT-Befehl ist obligatorisch!

# valUpdate.Error
source: Update command is mandatory!
de_de: Update-Befehl ist obligatorisch!

# Edit.Text
source: Edit Settings
de_de: Einstellungen bearbeiten

# Parameters.Text
source: Parameters
de_de: Parameter

# lblSql.Help
source: Shows the SQL statement which leads to the shown data
de_de: Zeigt den aktuellen SQL Befehl

# lblSql.Text
source: Show SQL
de_de: Zeige SQL

# lblAllowInserts.Help
source: Check if you want to allow special users to insert data
de_de: Überprüfen Sie, ob Sie ob Sie speziellen Benutzergruppen das Einfügen von Datensätzen erlauben möchten

# lblAllowInserts.Text
source: Allow Inserts
de_de: Einfügen zulassen

# lblInsert.Help
source: Enter the INSERT SQL statement which should insert the data. Use parameter syntax (e.g. INSERT INTO Table (field1,field2,field3) VALUES (@field1,@field2,@field3) )
de_de: Tragen Sie die INSERT SQL-Anweisung ein mit dem die Daten gelöscht werden sollen. Verwenden Sie Parametersyntax (z. B. INSERT INTO Tabelle (Field1...) VALUES (@Field1,...)

# lblInsert.Text
source: Insert Command
de_de: INSERT-Befehl

# lblRoleAllowInserts.Help
source: Select the role a user needs to have inserts rights (if 'allow inserts' is true)
de_de: Wählen Sie die Benutzerrolle, die ein Benutzer haben muss um Einfügerechte zu haben (wenn 'Einfügen zulassen' ausgewählt ist)

# lblRoleAllowInserts.Text
source: Insert Role
de_de: Einfügen-Benutzerrolle

# valInsert.Error
source: Insert command is mandatory!
de_de: INSERT-Befehl ist obligatorisch!

# lblHideModule.Help
source: if checked module is only shown if one of the defined search parameters is filled.
de_de: Wenn angehakt wird das Modul nur angezeigt wenn einer der definierten Parameter ausgefüllt ist

# lblHideModule.Text
source: Hide module
de_de: Modul verstecken

# lblLinkSource.Help
source: Enter a comma seperated list of fields which should be shown as links
de_de: Geben Sie eine kommaseparierte Liste der Felder an die als Links angezeigt werden sollen

# lblLinkSource.Text
source: Field-Links
de_de: Feld-Links

# Link.Text
source: Link Settings
de_de: Link Einstellungen
